In [2]:
import pandas as pd
#TASK
#ge, ne, ^, &, | 
df1 = pd.DataFrame({"A": [5,6,11,23,89], "B": [23,67,1,2,11]})
df2 = pd.DataFrame({"A": [4,74,14,23,98], "B": [21,87,47,62,31]})
print(df1.gt(df2))
print('\n')
print(df2.ne(df1))
print('\n')
print(df1 ^ df2 )  #Returns 1 where bits are different, else 0    [XOR operation]
print('\n')
print(df1 & df2 )  #Returns 1 where both bits are 1, else 0
print('\n')
print(df1 | df2 )  #Returns 1 where either bit is 1
#NOT operation (~)

       A      B
0   True   True
1  False  False
2  False  False
3  False  False
4  False  False


       A     B
0   True  True
1   True  True
2   True  True
3  False  True
4   True  True


    A   B
0   1   2
1  76  20
2   5  46
3   0  60
4  59  20


    A   B
0   4  21
1   2  67
2  10   1
3  23   2
4  64  11


     A   B
0    5  23
1   78  87
2   15  47
3   23  62
4  123  31

In [4]:
df3 = pd.DataFrame({"A": [5,6,11,23,89], "B": [23,0,1,2,11]}, dtype=bool)
df3

      A      B
0  True   True
1  True  False
2  True   True
3  True   True
4  True   True

In [5]:
#Series me sirf 1D array hi pass kr skte hai 
ser = pd.Series([[1,0,1], [0,0,1]])
df=pd.DataFrame(ser, dtype='bool')
print(ser)  
df

0    [1, 0, 1]
1    [0, 0, 1]
dtype: object

      0
0  True
1  True

In [6]:
#way to create a dataframe 
ser1 = pd.Series(range(3), index=list("abc"), name="ser")
pd.DataFrame(ser1)

   ser
a    0
b    1
c    2

In [7]:
#column aur row ka naam dono ko consider krega    #depriciated version
x=pd.DataFrame({"one": [5,6,11,23,89], "two": [23,0,1,2,11]}, index = ["a", "b", "c", "d", "e"])
print(x)
pd.DataFrame.from_records(x, index='one')

   one  two
a    5   23
b    6    0
c   11    1
d   23    2
e   89   11

     two
one
5     23
6      0
11     1
23     2
89    11

In [9]:
#set_index -> to give a name to the row   [single or multiple columns]
#df1.set_index(['column name1', 'column name2', ......])

In [10]:
#create a new column for some operations
y=pd.DataFrame({"one": [5,6,11,23,89], "two": [23,0,1,2,11]}, index = ["a", "b", "c", "d", "e"])
y['three'] = y['one'] * y['two']
y['three']
y

   one  two  three
a    5   23    115
b    6    0      0
c   11    1     11
d   23    2     46
e   89   11    979

In [11]:
y['flag'] = y['one'] > 2
y

   one  two  three  flag
a    5   23    115  True
b    6    0      0  True
c   11    1     11  True
d   23    2     46  True
e   89   11    979  True

In [12]:
#to delete a column from a dataframe
y.pop('two')

a    23
b     0
c     1
d     2
e    11
Name: two, dtype: int64

In [13]:
y

   one  three  flag
a    5    115  True
b    6      0  True
c   11     11  True
d   23     46  True
e   89    979  True

In [14]:
del ['three']

SyntaxError: cannot delete literal (2476332985.py, line 1)

In [15]:
del y['three']

In [16]:
y

   one  flag
a    5  True
b    6  True
c   11  True
d   23  True
e   89  True

In [17]:
#to create a new column   [puri column me same value rahegi jo di hogi hmne]
x['foo'] = 'bar'

In [18]:
x

   one  two  foo
a    5   23  bar
b    6    0  bar
c   11    1  bar
d   23    2  bar
e   89   11  bar

In [19]:
x['one_trunc'] = x['one'][:1]

In [20]:
x

   one  two  foo  one_trunc
a    5   23  bar        5.0
b    6    0  bar        NaN
c   11    1  bar        NaN
d   23    2  bar        NaN
e   89   11  bar        NaN

In [21]:
#insert method -> 
df = pd.DataFrame({'A' : [1,2,3,4], "B" : [11,56,78,90], "C" : [54,67,8,7]})
df.insert(1, 'New', df['C'])   #copy
df

   A  New   B   C
0  1   54  11  54
1  2   67  56  67
2  3    8  78   8
3  4    7  90   7

In [22]:
df.insert(4, 'D', [23,90,99,100])

In [23]:
df

   A  New   B   C    D
0  1   54  11  54   23
1  2   67  56  67   90
2  3    8  78   8   99
3  4    7  90   7  100

In [24]:
#to append dataframe 
df_1 = pd.DataFrame([[1,2], [3,4]], columns = ['a', 'b'])
df_2 = pd.DataFrame([[1,2], [3,4]], columns = ['a', 'b'])
print(df_1)
print(df_2)

   a  b
0  1  2
1  3  4
   a  b
0  1  2
1  3  4

In [25]:
df_1._append(df_2)

   a  b
0  1  2
1  3  4
0  1  2
1  3  4

In [26]:
df3 = pd.DataFrame([[1,2], [3,4]], columns = ['a', 'b'])
df4 = pd.DataFrame([[1,2], [3,4]], columns = ['one', 'two'], index = ['a', 'b'])

In [27]:
df3

   a  b
0  1  2
1  3  4

In [28]:
df4

   one  two
a    1    2
b    3    4

In [29]:
df3._append(df4)

     a    b  one  two
0  1.0  2.0  NaN  NaN
1  3.0  4.0  NaN  NaN
a  NaN  NaN  1.0  2.0
b  NaN  NaN  3.0  4.0

In [30]:
df5 = pd.DataFrame([[1,2], [3,4]], columns = ['a', 'b'])
df6 = pd.DataFrame([[1,2], [3,4]], columns = ['one', 'two'])

In [31]:
print(df5)
print(df6)

   a  b
0  1  2
1  3  4
   one  two
0    1    2
1    3    4

In [32]:
df5._append(df6)

     a    b  one  two
0  1.0  2.0  NaN  NaN
1  3.0  4.0  NaN  NaN
0  NaN  NaN  1.0  2.0
1  NaN  NaN  3.0  4.0

In [33]:
df7 = pd.DataFrame([[1,2], [3,4]], columns = ['a', 'b'], index = ['a', 'b'])
df8 = pd.DataFrame([[1,2], [3,4]], columns = ['a', 'b'], index = ['a', 'b'])

In [34]:
#transpose   -> df.T  [row to column, column to row]
print(df1.T)

    0   1   2   3   4
A   5   6  11  23  89
B  23  67   1   2  11

In [35]:
df1.axes       #riw and column axis label names

[RangeIndex(start=0, stop=5, step=1), Index(['A', 'B'], dtype='object')]

In [36]:
df1.empty    #whether the dataframe is empty or not

False

In [37]:
df1.dtypes

A    int64
B    int64
dtype: object

In [38]:
df1.ndim     #dimension of the dataframe

2

In [42]:
import numpy as np
#to create dataframe with random values  -> random.randn(rows, columns)
dfrand = pd.DataFrame(np.random.randn(10,4), columns = ['A', 'B', 'C', 'D'])
dfrand

          A         B         C         D
0 -1.011020  0.428489  0.860938 -0.292409
1  2.104709 -0.401255 -0.711258  1.538126
2 -0.952490 -0.343274  1.120413  1.950835
3 -0.312458  0.804521  0.338876  0.448639
4  0.723798 -0.340559  1.647446 -2.041507
5  0.291892  0.270225 -0.269147 -1.138832
6 -0.538495 -0.474469  0.960511 -1.104441
7  1.160700 -1.396433  0.744028  1.430740
8 -0.705191 -0.000858  0.231363  0.637386
9  0.370955 -0.458644  1.176129  0.673442

In [43]:
dfrand1 = pd.DataFrame(np.random.randn(7,3), columns = ['A', 'B', 'C'])
dfrand1

          A         B         C
0 -0.532850 -0.322490  0.913570
1  0.557614  0.260120  0.064490
2  1.107932  0.654712 -0.654511
3  0.162032 -0.220336  0.556548
4  0.532003 -0.740787  1.645899
5 -0.947676  0.096031  0.881391
6 -0.604082  0.948872  0.610243

In [44]:
dfrand + dfrand1

          A         B         C   D
0 -1.543870  0.105998  1.774508 NaN
1  2.662323 -0.141135 -0.646768 NaN
2  0.155442  0.311438  0.465902 NaN
3 -0.150425  0.584185  0.895424 NaN
4  1.255800 -1.081346  3.293344 NaN
5 -0.655785  0.366255  0.612244 NaN
6 -1.142577  0.474403  1.570754 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN